Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File            : main.c
  * Brief           : PlusCart(+) Firmware
  * Author          : Wolfgang Stubig <w.stubig@firmaplus.de>
  * Website         : https://gitlab.com/firmaplus/atari-2600-pluscart
  ******************************************************************************
  * (c) 2019 Wolfgang Stubig (Al_Nafuur)
  * based on: UnoCart2600 by Robin Edwards (ElectroTrains)
  *           https://github.com/robinhedwards/UnoCart-2600
  *           and
  *           UnoCart2600 fork by Christian Speckner (DirtyHairy)
  *           https://github.com/DirtyHairy/UnoCart-2600
  ******************************************************************************
  * This program is free software: you can redistribute it and/or modify
  * it under the terms of the GNU General Public License as published by
  * the Free Software Foundation, either version 3 of the License, or
  * (at your option) any later version.
  *
  * This program is distributed in the hope that it will be useful,
  * but WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program.  If not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <ctype.h>
#include <string.h>

#include "global.h"
#include "esp8266.h"
#include "flash.h"
#include "cartridge_io.h"
#include "cartridge_firmware.h"
#include "cartridge_supercharger.h"
#include "cartridge_detection.h"
#include "cartridge_emulation.h"
#include "cartridge_emulation_df.h"
#include "cartridge_emulation_bf.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

EXT_TO_CART_TYPE_MAP ext_to_cart_type_map[]__attribute__((section(".ccmram"))) = {
	{"ROM", { base_type_None, FALSE, FALSE }},
	{"BIN", { base_type_None, FALSE, FALSE }},
	{"A26", { base_type_None, FALSE, FALSE }},
	{"2K",  { base_type_2K, FALSE, FALSE }},
	{"4K",  { base_type_4K, FALSE, FALSE }},
	{"F8",  { base_type_F8, FALSE, FALSE }},
	{"F6",  { base_type_F6, FALSE, FALSE }},
	{"F4",  { base_type_F4, FALSE, FALSE }},
	{"F8S", { base_type_F8, TRUE, FALSE }},
	{"F6S", { base_type_F6, TRUE, FALSE }},
	{"F4S", { base_type_F4, TRUE, FALSE }},
	{"FE",  { base_type_FE, FALSE, FALSE }},
	{"3F",  { base_type_3F, FALSE, FALSE }},
	{"3E",  { base_type_3E, FALSE, FALSE }},
	{"E0",  { base_type_E0, FALSE, FALSE }},
	{"084", { base_type_0840, FALSE, FALSE }},
	{"CV", { base_type_CV, FALSE, FALSE }},
	{"EF", { base_type_EF, FALSE, FALSE }},
	{"EFS", { base_type_EF, TRUE, FALSE }},
	{"F0", { base_type_F0, FALSE, FALSE }},
	{"FA", { base_type_FA, FALSE, FALSE }},
	{"E7", { base_type_E7, FALSE, FALSE }},
	{"DPC", { base_type_DPC, FALSE, FALSE }},
	{"AR",  { base_type_AR, FALSE, FALSE }},
	{"BF",  { base_type_BF, FALSE, FALSE }},
	{"BFS",  { base_type_BFSC, FALSE, FALSE }},
	{"ACE",  { base_type_ACE, FALSE, FALSE }},
	{"WD",  { base_type_PP, FALSE, FALSE }},
	{"DF",  { base_type_DF, FALSE, FALSE }},
	{"DFS",  { base_type_DFSC, FALSE, FALSE }},
	{0,{0,0,0}}
};


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;


/* USER CODE BEGIN PV */
uint8_t c;
int num_menu_entries = 0;
char http_request_header[512];

uint8_t buffer[BUFFER_SIZE * 1024];
unsigned int cart_size_bytes;

USER_SETTINGS user_settings;

char curPath[256];

MENU_ENTRY menu_entries[NUM_MENU_ITEMS ]__attribute__((section(".ccmram")));


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
void buildMenuFromPath( MENU_ENTRY * )__attribute__((section(".flash0"))) ;



/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */



/*************************************************************************
 * Menu Handling
 *************************************************************************/

char *get_filename_ext(char *filename) {
	char *dot = strrchr(filename, '.');
	if(!dot || dot == filename) return "";
	return dot + 1;
}

int is_valid_file(char *filename) {
	char *ext = get_filename_ext(filename);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (strcasecmp(ext, p->ext) == 0)
			return 1;
		p++;
	}
	return 0;
}

void make_menu_entry( MENU_ENTRY **dst, char *name, int type){
	(*dst)->type = type;
	strcpy((*dst)->entryname, name);
	(*dst)->filesize = 0U;
	(*dst)++;
	num_menu_entries++;
}
void make_keyboard(MENU_ENTRY **dst){
	make_menu_entry(&(*dst), "(GO BACK)", Leave_Menu); // TODO Delete last Char or All?
	make_menu_entry(&(*dst), "(DEL CHAR)", Delete_Keyboard_Char); // TODO Delete last Char or All?
	char Key[2] = "0";
	for (char i=32; i < 100; i++){
		Key[0] = i;
		make_menu_entry(&(*dst), Key, Keyboard_Char);
	}
	make_menu_entry(&(*dst), "Enter", Menu_Action);

}

void buildMenuFromPath( MENU_ENTRY *d )  {
	int count = 0;
	_Bool loadStore = FALSE;
	_Bool is_entry_row;
	uint8_t pos = 0;
	num_menu_entries = 0;

	MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];

