Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	if(strncmp(MENU_TEXT_SETUP, curPath, sizeof(MENU_TEXT_SETUP) - 1) == 0 ){
		//char *  curPathPos = (char *) &curPath[sizeof(MENU_TEXT_SETUP)];
		if(strlen(curPath) == sizeof(MENU_TEXT_SETUP) - 1 ){
			make_menu_entry(&dst, "(GO Back)", Leave_Menu);
			make_menu_entry(&dst, MENU_TEXT_WIFI_SETUP, Sub_Menu);
			make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Sub_Menu);
			//make_menu_entry(&dst, MENU_TEXT_PRIVATE_KEY, Sub_Menu);
			if(	flash_has_downloaded_roms() )
			    		make_menu_entry(&dst, MENU_TEXT_DELETE_OFFLINE_ROMS, Menu_Action);

        	set_menu_status_msg("Ver. " VERSION "  ");
			loadStore = TRUE;
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WIFI_SETUP, sizeof(MENU_TEXT_WIFI_SETUP) - 1) == 0 ){
			if(strlen(curPath) > sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) ){
				if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
					// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" SSID[33] + Password + "/Enter" + '\0'
					curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path

					// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
					int i = sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP);
			        while( curPath[i] != 30 && i < ( sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 31) ){
			            i++;
			        }
			        curPath[i] = 0;

			    	if(esp8266_wifi_connect( &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP)  ], &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 32])){
			        	set_menu_status_msg(STATUS_MESSAGE_WIFI_CONNECTED);
			    	}else{
			        	set_menu_status_msg(STATUS_MESSAGE_WIFI_NOT_CONNECTED);
			    	}
					curPath[0] = '\0';
				}else{
					make_keyboard(&dst);
				}

			}else{
				make_menu_entry(&dst, "(GO BACK)", Leave_Menu);
				if( esp8266_wifi_list( &dst, &num_menu_entries) == FALSE){
		        	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
		    		return;
		    	}
			}
		}else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_TV_MODE_SETUP, sizeof(MENU_TEXT_TV_MODE_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){
				uint8_t new_tv_mode = TV_MODE_NTSC;
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_PAL) == 0){
					new_tv_mode = TV_MODE_PAL;
				}else if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_PAL60) == 0){
					new_tv_mode = TV_MODE_PAL60;
				}
				set_tv_mode(new_tv_mode);
				if(user_settings.tv_mode != new_tv_mode){
					user_settings.tv_mode = new_tv_mode;
					flash_set_eeprom_user_settings(user_settings);
				}
	        	curPath[0] = '\0';
			}else{
				make_menu_entry(&dst, "(GO Back)", Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_PAL, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_PAL60, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_NTSC, Menu_Action);
			}

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT, sizeof(MENU_TEXT_PLUS_CONNECT) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user
				if( esp8266_PlusStore_API_prepare_request(curPath, FALSE) == FALSE){
	            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
					return;
				}
	        	HAL_UART_Transmit(&huart1, (uint8_t *)http_request_header, strlen(http_request_header), 50);

	        	skip_http_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){}
	        	if(c == '0')
	        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECT_FAILED);
	        	else if(c == '1')
	        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CREATED);
	        	else
	        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECTED);

	        	if( ! close_transparent_transmission() ){
	            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
	        		return;
	        	}

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT) == 0){
					set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECT);
				}
				make_keyboard(&dst);
			}
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_REMOVE, sizeof(MENU_TEXT_PLUS_REMOVE) - 1) == 0 ){
			if( esp8266_PlusStore_API_prepare_request(curPath, FALSE) == FALSE){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
				return;
			}
        	HAL_UART_Transmit(&huart1, (uint8_t *)http_request_header, strlen(http_request_header), 50);

        	skip_http_header();
        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){}
        	if(c == '0')
        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECT_FAILED);
        	else
        		set_menu_status_msg(STATUS_MESSAGE_PLUS_REMOVED);

        	if( ! close_transparent_transmission() ){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
        		return;
        	}

        	curPath[0] = '\0';

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_DELETE_OFFLINE_ROMS, sizeof(MENU_TEXT_DELETE_OFFLINE_ROMS) - 1) == 0 ){
			HAL_FLASH_Unlock();
	        for( count = FLASH_SECTOR_5; count <= FLASH_SECTOR_11; count++){
		        FLASH_Erase_Sector((uint32_t) count, (uint8_t) FLASH_VOLTAGE_RANGE_3);
		    }
			HAL_FLASH_Lock();
    		set_menu_status_msg(STATUS_MESSAGE_OFFLINE_ROMS_DELETED);
        	curPath[0] = '\0';
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY, sizeof(MENU_TEXT_PRIVATE_KEY) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Save Private key
				set_menu_status_msg(STATUS_MESSAGE_PRIVATE_KEY_SAVED);

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY ) == 0){
					set_menu_status_msg(STATUS_MESSAGE_PRIVATE_KEY);
				}
				make_keyboard( &dst);
			}
		}
	}else if(strncmp(MENU_TEXT_OFFLINE_ROMS, curPath, sizeof(MENU_TEXT_OFFLINE_ROMS) - 1) == 0 ){
		make_menu_entry(&dst, "..", Leave_Menu);
		flash_file_list(&curPath[sizeof(MENU_TEXT_OFFLINE_ROMS) - 1], &dst, &num_menu_entries);
	}else if(d->type == Menu_Action){
		if(strncmp(MENU_TEXT_FIRMWARE_UPDATE, curPath, sizeof(MENU_TEXT_FIRMWARE_UPDATE) - 1) == 0 ){
			if( esp8266_PlusStore_API_prepare_request("&u=1", TRUE) == FALSE){
		    	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
			}
		    strcat(http_request_header, (char *)"     0-  4095\r\n\r\n");
			__disable_irq();
			HAL_FLASH_Unlock();
			do_flash_update(d->filesize, (uint8_t *)http_request_header, ADDR_FLASH_SECTOR_0, 0);
		} else if(strncmp(MENU_TEXT_OFFLINE_ROM_UPDATE, curPath, sizeof(MENU_TEXT_OFFLINE_ROM_UPDATE) - 1) == 0 ){
			if( esp8266_PlusStore_API_prepare_request("&r=1", TRUE) == FALSE){
		    	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
			}
		    strcat(http_request_header, (char *)"     0-  4095\r\n\r\n");
			__disable_irq();
			HAL_FLASH_Unlock();
			do_flash_update(d->filesize, (uint8_t *)http_request_header, ADDR_FLASH_SECTOR_5, 0);
		}

    	curPath[0] = '\0';
	}else{
		loadStore = TRUE;
	}

