Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	if (cart_type.base_type != base_type_None)
		cart_size_bytes = d->filesize;

	return cart_type;
}




/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(CART_TYPE cart_type, MENU_ENTRY *d)
{
	int offset = 0;
	if (cart_type.withPlusFunctions == TRUE ){
 		// Read path and hostname in ROM File from 0xf00  till '\0' and
		// copy to http_request_header
		offset = connect_PlusROM_API();
	}

	if (cart_type.base_type == base_type_2K)
		emulate_2k_4k_cartridge(offset, cart_type.withPlusFunctions, 0x7FF);
	else if (cart_type.base_type == base_type_4K)
		emulate_2k_4k_cartridge(offset, cart_type.withPlusFunctions, 0xFFF);
	else if (cart_type.base_type == base_type_F8)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FF8, 0x1FF9, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F6)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FF6, 0x1FF9, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F4)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FF4, 0x1FFB, cart_type.withSuperChip );
	else if (cart_type.base_type == base_type_FE)
		emulate_FE_cartridge();
	else if (cart_type.base_type == base_type_3F)
		emulate_3F_cartridge();
	else if (cart_type.base_type == base_type_3E)
		emulate_3E_cartridge(offset, cart_type.withPlusFunctions);
	else if (cart_type.base_type == base_type_E0)
		emulate_E0_cartridge();
	else if (cart_type.base_type == base_type_0840)
		emulate_0840_cartridge();
	else if (cart_type.base_type == base_type_CV)
		emulate_CV_cartridge();
	else if (cart_type.base_type == base_type_EF)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FE0, 0x1FEF, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F0)
		emulate_F0_cartridge();
	else if (cart_type.base_type == base_type_FA)
		emulate_FA_cartridge();
	else if (cart_type.base_type == base_type_E7)
		emulate_E7_cartridge();
	else if (cart_type.base_type == base_type_DPC)
		emulate_DPC_cartridge(cart_size_bytes);
	else if (cart_type.base_type == base_type_AR)
		emulate_supercharger_cartridge(curPath, cart_size_bytes, buffer, user_settings.tv_mode);
	else if (cart_type.base_type == base_type_PP)
		emulate_pp_cartridge( buffer + 8*1024);
	else if (cart_type.base_type == base_type_DF)
		emulate_df_cartridge(curPath, cart_size_bytes, buffer, d);
	else if (cart_type.base_type == base_type_DFSC)
		emulate_dfsc_cartridge(curPath, cart_size_bytes, buffer, d);
	else if (cart_type.base_type == base_type_BF)
		emulate_bf_cartridge(curPath, cart_size_bytes, buffer, d);//cart_type.flash_part_address);
	else if (cart_type.base_type == base_type_BFSC)
		emulate_bfsc_cartridge(curPath, cart_size_bytes, buffer, d);//cart_type.flash_part_address);
	else if (cart_type.base_type == base_type_ACE)
		set_menu_status_msg(STATUS_MESSAGE_ROMTYPE_UNSUPPORTED);
}

void convertMenuNameForCart(unsigned char *dst, char *src)
{
	memset(dst, ' ', 12);
	for (int i=0; i<12; i++) {
		if (!src[i]) break;
		dst[i] = toupper(src[i]);
	}
}

void createMenuForAtari( MENU_ENTRY *d )
{
	buildMenuFromPath( d);
	uint8_t *menu_ram = get_menu_ram();
	// create a table of entries for the atari to read
	memset(menu_ram, 0, NUM_MENU_ITEMS_MEM);
	for (int i=0; i<num_menu_entries; i++)
	{
		unsigned char *dst = menu_ram + i*12;
		convertMenuNameForCart(dst, menu_entries[i].entryname);
		// set the high-bit of the first character if Submenu or Upmenu
		if (menu_entries[i].type == Sub_Menu || menu_entries[i].type == Leave_Menu) *dst += 0x80;
	}
}

void truncate_curPath(){
    int len = strlen(curPath);
  	while (len && curPath[--len] != '/');
  	curPath[len] = 0;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

	curPath[0] = '\0';
	CART_TYPE cart_type = { base_type_None, FALSE, FALSE };
	_Bool usart_not_init = TRUE;

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  //  MX_USART1_UART_Init(); /* USART1_Init is done later at before  wifi init
  /* USER CODE BEGIN 2 */

  user_settings = flash_get_eeprom_user_settings();
  set_tv_mode(user_settings.tv_mode);
 //		  user_settings.free_flash_address = &eeprom_junk[1];

  // set up status area
  set_menu_status_msg("BY W.STUBIG ");
  set_menu_status_byte(0);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
    int ret = emulate_firmware_cartridge();
    if (ret == CART_CMD_ROOT_DIR || ret >= num_menu_entries){

    	MENU_ENTRY d;
    	d.type = Root_Menu;
    	d.filesize = 0;

      if(usart_not_init){
    	  MX_USART1_UART_Init();
    	  Initialize_ESP8266();
    	  generate_udid_string();
		  usart_not_init = FALSE;
      }
      buffer[0] = 0;
      curPath[0] = 0;
      createMenuForAtari(&d);
      if(ret != CART_CMD_ROOT_DIR && ret >= num_menu_entries){
          set_menu_status_msg("erorr r>n   ");
      }

    } else {
      MENU_ENTRY *d = &menu_entries[ret];
      if (d->type == Cart_File || d->type == Offline_Cart_File){
    	// selection is a rom file
    	uint32_t max_romsize = (((BUFFER_SIZE + CCM_RAM_SIZE) * 1024) + (12 - user_settings.first_free_flash_sector) * 128 * 1024 );
    	if(d->filesize > max_romsize ){
            set_menu_status_msg(STATUS_MESSAGE_NOT_ENOUGH_MENORY);
    	}else{
            cart_type = identify_cartridge(d);
            HAL_Delay(200);
            if (cart_type.base_type != base_type_None){
                emulate_cartridge(cart_type, d);
            }
    	}

    	truncate_curPath();

      } else {
        // selection is a directory or Menu_Action, or Keyboard_Char
  		if (d->type == Leave_Menu){
  		  // go back clear_curPath();//
  		  truncate_curPath();
  		  buffer[0] = 0; // Reset Keyboard input field
  		} else if(d->type == Delete_Keyboard_Char){
    		  int len = strlen(curPath);
    		  if(len && curPath[--len] != '/' ){
    	  		  curPath[len] = 0;
    		  }
    		  len = strlen((char *) buffer);
    		  if(len){
    			  buffer[--len] = 0;
    		  }
  	    	  set_menu_status_msg((char *)buffer);
  		} else {
  		  // go into Menu TODO find better way for separation of first keyboard char!!
  		  if(( d->type != Keyboard_Char && strlen(curPath) > 0) || strcmp(MENU_TEXT_SETUP"/"MENU_TEXT_PLUS_CONNECT, curPath) == 0 ){
    		    strcat(curPath, "/");
  		  }

